#task02
"""
Дан список чисел, заменить каждый отрицательный элемент на следующий
	[1, 2, -3, 5, -6, 7, -9] -> [1, 2, 5, 5, 7, 7, -9]
"""
a = [1, 2, -3, 5, -6, 7, -9]
def f(a):
    for i in range(len(a) - 1):
        if a[i] < 0:
            a[i] = a[i + 1]
    return a
print(f(a))