#task06
"""
6. Определить, является ли треугольник со сторонами a, b, c равнобедренным
"""
a = int(input('Введите число a\n>'))
b = int(input('Введите число b\n>'))
c = int(input('Введите число c\n>'))
if a == b == c:
    print ('Треугольник равнобедренный!')
else:
    print ('Треугольник не равнобедренный!')