"""
Написать функцию, которая определяет количество разрядов введенного целого числа.
Пример:
>> func(40)
>> 2
>> func(404)
>> 3

"""
import time
a = str(input('Введите число\n>'))
print(len(a))

# a = input('Введите число\n>')
# c = 0
# for n in a:
#     int(a) / 10 > 0
#     c += 1
# print(c)
#

